# -*- coding: utf-8 -*-
# -*- mode: org -*-

# beamer
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [aspectratio=169, xcolor={table}]
#+BEAMER_FRAME_LEVEL: 2
#+OPTIONS: H:2 toc:nil num:nil author:nil date:nil
#+latex_header: \usepackage[citestyle=authoryear, bibstyle=authoryear, hyperref=true,backref=true,maxcitenames=2,url=true,backend=biber,natbib=true]{biblatex}
#+latex_header: \addbibresource{../biblio.bib}
# #+latex_header: \addbibresource{~/Papers/references.bib}
#+LATEX_HEADER: \input{../packages.tex}
#+LATEX_HEADER: \input{../notations.tex}
#+LATEX_HEADER: \input{header.tex}

#+TITLE: Factorization Matrix Methods For Genomic Association Testing
#+AUTHOR: Kévin CAYE
#+LANGUAGE: en
#+STARTUP: overview indent inlineimages logdrawer
#+TAGS: noexport(n)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+COLUMNS: %25ITEM %TODO %3PRIORITY %TAGS
#+SEQ_TODO: TODO(t!) STARTED(s!) WAITING(w!) RUNNING(r!) DEBUG(g!) APPT(a!) | DONE(d!) CANCELLED(c!) DEFERRED(f!)


#+PROPERTY: header-args :eval no-export :exports none

** Results of the gene-environment association study

#+LATEX: \begingroup\fontsize{9}{9}\selectfont
#+LATEX: \rowcolors{2}{gray!25}{white}
#+NAME: code:geas_table_print
#+CAPTION: Dépend de [[file:~/Projects/Thesis/MaThese/main.org::code:geas_table][code:geas_table]]
#+begin_src R :results output latex replace :exports results :session *R* :dir ~/Projects/Thesis/MaThese/
  library(xtable)
  library(knitr)
  library(kableExtra)

  table.df <- readRDS("../OUTPUT/Expr/geas_table_toprint.rds")

  ## table.df %>% names() %>% paste0(collapse = "|")

  table.df %>%
    xtable(align = "lp{4cm}ll", type = "latex", label = "table:geas") %>%
    print(include.rownames=FALSE,
          sanitize.colnames.function=identity,
          sanitize.text.function=identity,
          floating = TRUE
          )
#+end_src

#+RESULTS: code:geas_table_print
#+BEGIN_EXPORT latex
% latex table generated in R 3.4.0 by xtable 1.8-2 package
% Wed Nov 15 14:32:05 2017
\begin{table}[ht]
\centering
\begin{tabular}{p{4cm}ll}
  \hline
SNPs & Détecté par les méthodes & Description du phénotype \\ 
  \hline
rs10908907 & ridgeLFMM, cate & Alcoholism (heaviness of drinking) \\ 
  rs10496731 & lassoLFMM & Body Height \\ 
  rs2472297 & ridgeLFMM, cate, lassoLFMM & Caffeine metabolism \\ 
  rs2256175 & ridgeLFMM, cate, lassoLFMM & Cholesterol total \\ 
  rs2472297 & ridgeLFMM, cate, lassoLFMM & Coffee consumption (cups per day) \\ 
  rs2278544, rs2322659 & lassoLFMM & Congenital lactase deficiency \\ 
  rs4954218 & ridgeLFMM, cate, lassoLFMM & Corneal structure \\ 
  rs882300 & ridgeLFMM, cate, lassoLFMM & Electrocardiographic traits \\ 
  rs882300 & ridgeLFMM, cate, lassoLFMM & Electrocardiography \\ 
  rs2256175 & ridgeLFMM, cate, lassoLFMM & Giant cell arteritis \\ 
  rs2256175, rs6085576, rs2104012, rs1983716, rs2853977 & ridgeLFMM, cate, lassoLFMM & Height \\ 
  rs6430549 & ridgeLFMM, cate, lassoLFMM & Hematocrit \\ 
  rs2278544, rs2322659 & lassoLFMM & Lactose intolerance \\ 
  rs882300 & ridgeLFMM, cate, lassoLFMM & Multiple sclerosis \\ 
  rs1123848 & ridgeLFMM, cate, lassoLFMM & Neuroblastoma \\ 
  rs17158483 & lassoLFMM & Obesity-related traits \\ 
   \hline
\end{tabular}
\label{table:geas}
\end{table}
#+END_EXPORT

#+LATEX:\rowcolors{2}{}{}
#+LATEX: \endgroup
** Methylation sites found out in other studies (Rahmani et al. 2016, Zou et al. 2014) (EWAS)

#+LATEX: \begingroup\fontsize{9}{9}\selectfont
#+LATEX: \rowcolors{2}{gray!25}{white}
#+NAME: code:ewas_table_print
#+CAPTION: Dépend de [[file:~/Projects/Thesis/MaThese/main.org::code:ewas_table][code:ewas_table]] 
#+begin_src R :results output latex replace :exports results :session *R* :dir ~/Projects/Thesis/MaThese/
  library(xtable) ## https://cran.r-project.org/web/packages/xtable/vignettes/xtableGallery.pdf

  ewas.table <- readRDS("../OUTPUT/Expr/ewas_table_toprint.rds")

  ewas.table %>%
    xtable(align = "lllllcccc",
           digits = -2, type = "latex",
           label = "table:ewas") %>%
    print(include.rownames=FALSE,
          sanitize.text.function=identity)

#+end_src

#+RESULTS: code:ewas_table_print
#+BEGIN_EXPORT latex
% latex table generated in R 3.4.0 by xtable 1.8-2 package
% Wed Nov 15 14:30:37 2017
\begin{table}[ht]
\centering
\begin{tabular}{llllcccc}
  \hline
ID & Chr & Position & Gene & PCAlm & lassoLFMM & cate & ridgeLFMM \\ 
  \hline
\textbf{cg16411857} & \textbf{16} & \textbf{57023191} & \textbf{NLRC5} & \textbf{9.2e-13} & \textbf{2.4e-12} & \textbf{6.6e-12} & \textbf{5.3e-12} \\ 
  \textbf{cg07839457} & \textbf{16} & \textbf{57023022} & \textbf{NLRC5} & \textbf{1.9e-11} & \textbf{4.5e-11} & \textbf{1.1e-10} & \textbf{9.7e-11} \\ 
  \textbf{cg05428452} & \textbf{6} & \textbf{32712979} & \textbf{HLA-DQA2} & \textbf{5.4e-11} & \textbf{4.6e-11} & \textbf{8.5e-11} & \textbf{8.8e-11} \\ 
  cg02508743 & 8 & 56903623 & LYN & 2.9e-08 & 2.7e-08 & 2.7e-08 & 2.8e-08 \\ 
  \textbf{cg20821042} & \textbf{6} & \textbf{32709158} & \textbf{HLA-DQA2} & \textbf{6.5e-08} & \textbf{6.1e-08} & \textbf{9.6e-08} & \textbf{1.0e-07} \\ 
  cg13081526 & 6 & 32449961 &  & 1.5e-07 & 1.2e-07 & 2.0e-07 & 2.2e-07 \\ 
  cg18052547 & 6 & 32552547 & HLA-DRB1 & 1.8e-07 & 1.8e-07 & 3.0e-07 & 3.1e-07 \\ 
  \textbf{cg25372449} & \textbf{6} & \textbf{32490350} & \textbf{HLA-DRB5} & \textbf{2.5e-07} & \textbf{2.6e-07} & \textbf{4.5e-07} & \textbf{4.6e-07} \\ 
  cg02030958 & 13 & 110386267 &  & 4.0e-07 & 7.8e-08 & 6.0e-08 & 1.1e-07 \\ 
  cg16171858 & 3 & 58472734 &  & 4.6e-07 & 1.6e-07 & 2.7e-08 & 3.8e-08 \\ 
  cg03280622 & 8 & 145023013 & PLEC1 & 4.7e-07 & 5.0e-09 & 5.8e-09 & 3.8e-08 \\ 
  cg24150157 & 19 & 51891210 & LIM2 & 6.2e-07 & 3.1e-07 & 1.6e-07 & 2.1e-07 \\ 
  cg26244575 & 12 & 76354015 &  & 6.9e-07 & 2.7e-09 & 5.0e-10 & 4.2e-09 \\ 
  cg05370853 & 6 & 32606634 & HLA-DQA1 & 7.1e-07 & 3.0e-07 & 3.3e-07 & 4.4e-07 \\ 
  cg14989316 & 10 & 80757927 & LOC283050 & 7.3e-07 & 6.1e-08 & 7.8e-08 & 2.1e-07 \\ 
  cg17360552 & 6 & 32725332 & HLA-DQB2 & 8.1e-07 & 6.1e-07 & 1.1e-06 & 1.2e-06 \\ 
  cg01373248 & 3 & 18480297 & SATB1 & 8.1e-07 & 1.4e-07 & 1.1e-07 & 2.5e-07 \\ 
  cg26164488 & 2 & 64440295 &  & 9.3e-07 & 3.5e-09 & 1.6e-09 & 1.4e-08 \\ 
  cg05874806 & 2 & 102350276 & MAP4K4 & 1.1e-06 & 1.1e-06 & 4.7e-07 & 5.6e-07 \\ 
   \hline
\end{tabular}
\label{table:ewas}
\end{table}
#+END_EXPORT

#+LATEX:\rowcolors{2}{}{}
#+LATEX: \endgroup
